Redis create:
```
OpenTofu will perform the following actions:

  # google_redis_instance.chat_app_redis will be created
  + resource "google_redis_instance" "chat_app_redis" {
      + alternative_location_id  = (known after apply)
      + auth_enabled             = true
      + auth_string              = (sensitive value)
      + authorized_network       = "https://www.googleapis.com/compute/v1/projects/angelic-digit-297517/global/networks/chat-app-network"
      + connect_mode             = "PRIVATE_SERVICE_ACCESS"
      + create_time              = (known after apply)
      + current_location_id      = (known after apply)
      + display_name             = "chat-app-redis-instance"
      + effective_labels         = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "sgune"
        }
      + host                     = (known after apply)
      + id                       = (known after apply)
      + labels                   = {
          + "environment" = "dev"
          + "owner"       = "sgune"
        }
      + location_id              = (known after apply)
      + maintenance_schedule     = (known after apply)
      + maintenance_version      = (known after apply)
      + memory_size_gb           = 1
      + name                     = "chat-app-redis"
      + nodes                    = (known after apply)
      + persistence_iam_identity = (known after apply)
      + port                     = (known after apply)
      + project                  = "angelic-digit-297517"
      + read_endpoint            = (known after apply)
      + read_endpoint_port       = (known after apply)
      + read_replicas_mode       = (known after apply)
      + redis_version            = "REDIS_7_2"
      + region                   = "us-central1"
      + replica_count            = (known after apply)
      + reserved_ip_range        = "google-managed-services"
      + secondary_ip_range       = (known after apply)
      + server_ca_certs          = (known after apply)
      + terraform_labels         = {
          + "environment"                = "dev"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "sgune"
        }
      + tier                     = "STANDARD_HA"
      + transit_encryption_mode  = "DISABLED"

      + maintenance_policy {
          + create_time = (known after apply)
          + update_time = (known after apply)

          + weekly_maintenance_window {
              + day      = "FRIDAY"
              + duration = (known after apply)

              + start_time {
                  + hours   = 2
                  + minutes = 0
                }
            }
        }

      + timeouts {
          + create = "20m"
          + delete = "20m"
          + update = "20m"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + auth_string = (sensitive value)
  + host        = (known after apply)
  + port        = (known after apply)
```